<template>
    <div>
        <ve-line :data="chartData" :settings="chartSettings" :extend="extend" :height="heightLj"></ve-line>
    </div>
</template>

<script>
  export default {
    data () {
      this.chartSettings = {
      //  stack: { '用户': ['访问用户', '下单用户'] },
       area: true
      },
      this.extend={
          title:{
              show:false
          },
          legend:{
              show:false
          },
        //   grid:{
        //       bottom:0
        //   }
      }
      return {
        chartData: {
          columns: ['日期', '访问用户'],
          rows: [
            { '日期': '1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
            { '日期': '2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
            { '日期': '3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
            { '日期': '4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
            { '日期': '5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
            { '日期': '6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '7', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '8', '访问用户': 1723, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '9', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '10', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '11', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '12', '访问用户': 1233, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '13', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '14', '访问用户': 1233, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '15', '访问用户': -1233, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '16', '访问用户': -4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '17', '访问用户': -4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '18', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '19', '访问用户': 1233, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '20', '访问用户': 89, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '21', '访问用户': -1233, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '22', '访问用户': 234, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '23', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '24', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '25', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '26', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '27', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '28', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '29', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '30', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            { '日期': '31', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
          ]
        },
        heightLj:'200px'
      }
      
    }
  }
</script>