<template>
  <ve-histogram :data="chartData" :settings="chartSettings" :extend="extend" height="300px"></ve-histogram>
</template>

<script>
  export default {
    data () {
     this.chartSettings = {
        labelMap:{
          'mth': '月份',
          'tc0' : '前年统筹支付',
          'zh0' : '前年账户支付',
          'xj0' : '前年现金支付',
          'tc1' : '去年统筹支付',
          'zh1' : '去年账户支付',
          'xj1' : '去年现金支付',
          'tc2' : '今年统筹支付',
          'zh2' : '今年账户支付',
          'xj2' : '今年现金支付'
        },
        legendName: {
          '2018': 'total'
        },
        stack: { '2018': ['tc0', 'zh0','xj0'],'2019': ['tc1', 'zh1','xj1'] ,'2020':['tc2', 'zh2','xj2']},
      }
      this.extend = {
        series: {
          label: { show: false, position: "top" }
        },
        color: [//定义了线条，柱状图的颜色，颜色值的顺序你要跟你上面的totalYearList存储的顺序要一直
                "#dc2244", "#75c2ef", "#4562f3",
                "#dc2244", "#75c2ef", "#4562f3",
                "#dc2244", "#75c2ef", "#4562f3"
        ],
      }
      return {
        chartData: {
          columns: ['mth', 'tc0', 'zh0', 'xj0', 'tc1', 'zh1', 'xj1', 'tc2', 'zh2', 'xj2'],
          rows: [
            { 'mth': '1月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '2月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '3月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '4月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '5月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '6月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '7月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '8月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '9月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '10月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '11月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332},
             { 'mth': '12月', 'tc0': 1393, 'zh0': 1093, 'xj0':2332,'tc1': 1393, 'zh1': 1093, 'xj1':2332,'tc2': 1393, 'zh2': 1093, 'xj2':2332}
          ]
        }
      }
    }
  }
</script>